// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   MapStrings.uni
// 
// Abstract:
// 
//   String definitions for command 'map'
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"

#string STR_SHELLENV_MAP_SHORT_INFO    #language eng  "  %e-.*s :%s%s - %HAlias%N %es\n"

#string STR_SHELLENV_MAP_THREE_VAR     #language eng  "  %e-.*s :%s\n"

#string STR_SHELLENV_MAP_CONSIST_NAME  #language eng  "  %e-.*s  %HConsistent Name%N %es\n"

#string STR_SHELLENV_MAP_OTHER_NAME    #language eng  "  %e-.*s  %HOther Name%N   %es\n"

#string STR_SHELLENV_MAP_DEVICE_PATH   #language eng  "  %e-.*s  %s\n"

#string STR_SHELLENV_MAP_MEDIA_TYPE    #language eng  "  %e-.*s  %HMedia Type%N   %s\n"

#string STR_SHELLENV_MAP_REMOVEABLE    #language eng  "  %e-.*s  %HRemoveable%N   %s\n"

#string STR_SHELLENV_MAP_CUR_DIR       #language eng  "  %e-.*s  %HCurrent Dir%N  %s\n"

#string STR_SHELLENV_MAP_HANDLE_NOT_FOUND #language eng  "%*s= Handle for this mapping not found\n"

#string STR_SHELLENV_MAP_HANDLE        #language eng  "%*s %HHandle%N      "

#string STR_SHELLENV_MAP_TWO_VARS_S    #language eng  "%*s> %s\n\n"

#string STR_SHELLENV_MAP_UNKNOWN_FLAG  #language eng  "%Hmap%N: Unknown flag %hs\n"

#string STR_SHELLENV_MAP_TOO_MANY_ARGS #language eng  "%Hmap%N: Too many arguments\n"

#string STR_SHELLENV_DEVICE_MAPPING_TABLE #language eng  "%EDevice mapping table%N\n"

#string STR_SHELLENV_MAP_HANDLE_NOT_FOUND_2 #language eng  "%Hmap%N: Handle %hx not found\n"

#string STR_SHELLENV_MAP_DEV_PATH_NOT_FOUND #language eng  "%Hmap%N: Device path of handle %h02x not found\n"

#string STR_SHELLENV_MAP_CANNOT_FIND_HANDLE #language eng  "%Hmap%N: Cannot find handle %hs \n"

#string STR_SHELLENV_MAP_NO_BLOCK_IO   #language eng  "%Hmap%N: No block io protocol found on handle '%H0x%N%hx'\n"

#string STR_SHELLENV_MAP_CANNOT_FIND_SNAME #language eng  "%Hmap%N: Can not find map name '%hs'\n"

#string STR_SHELLENV_MAP_INVALID_NAME  #language eng  "%Hmap%N: Invalid sname '%hs'\n"

#string STR_SHELLENV_MAP_NOSPACES      #language eng  "%Hmap%N: Spaces are not allowed inside of Sname\n"

#string STR_SHELLENV_MAP_NOREDIRECT    #language eng  "%Hmap%N: Redirection  are not allowed when reset\n"

#string STR_SHELLENV_ONE_VAR_S         #language eng  "%hs\n"

#string STR_SHELLENV_MAP_NOT_EXIST     #language eng  "%Hmap%N: Can not find required map name.\n"
